SIGS/app/views/rooms/_rooms_filter.html.erb

          <% if @user_department == nil %>
            <%= select_tag 'department_id', options_for_select(@department.map{ |department| [department.name, department.id, { 'data-campus' => department.campus.name } ]}), include_blank: true, class: 'select-filter' %>
---
SELECT  `campuses`.* FROM `campuses` WHERE `campuses`.`id` IS NULL LIMIT 1