SIGS/app/views/school_rooms/index.html.erb

            <td>
              <% school_room.courses.each do |course| %>
---
SELECT `courses`.* FROM `courses` INNER JOIN `courses_school_rooms` ON `courses`.`id` = `courses_school_rooms`.`course_id` WHERE `courses_school_rooms`.`school_room_id` = 1