app/controllers/administrative_assistants_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`active` = 0
---
  def registration_request
    @users = User.where(active: 0)