app/controllers/api_users_controller.rb

  def index
    @api_users = ApiUser.where(user_id: current_user.id)
---
SELECT `api_users`.* FROM `api_users` WHERE `api_users`.`user_id` = 6

  def find_api_user
    @api_user = ApiUser.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1