app/controllers/reports_disciplines_controller.rb

  def by_discipline
    @disciplines = Discipline.all
---
SELECT `disciplines`.* FROM `disciplines`