SIGS/app/views/users/show.html.erb

SELECT  `periods`.* FROM `periods` ORDER BY `periods`.`id` ASC LIMIT 1 OFFSET 1
---
          <tr>
            <th><%=@periods.first.period_type%></th>