SIGS/app/controllers/rooms_controller.rb

  def index
    @rooms = Room.all
    @rooms = @rooms.paginate(page: params[:page], per_page: 10)
    @buildings = Building.all
    @department = Department.all
    @user_department = find_user_department
    @campi = Campus.all
---
SELECT  `rooms`.* FROM `rooms` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `rooms`
SELECT `buildings`.* FROM `buildings`
SELECT `departments`.* FROM `departments`
SELECT `campuses`.* FROM `campuses`