SIGS/app/controllers/school_rooms_controller.rb

SELECT  `school_rooms`.* FROM `school_rooms` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `school_rooms`
---
  def index
    if permission[:level] == 1
      @my_school_rooms = SchoolRoom.joins(:discipline).merge(
        Discipline.order(:name).where(department_id: department_by_coordinator)
      ).order(:name)
      @disciplines = discipline_of_department(department_by_coordinator)
                     .order(:name)
                     .map(&:name)

    else
      @my_school_rooms = SchoolRoom.all
    end
    @my_school_rooms = sort_school_rooms_by_allocation
    puts @my_school_rooms.inspect
    @my_school_rooms = @my_school_rooms.paginate(page: params[:page], per_page: 10)