SIGS/app/controllers/sessions_controller.rb

  def create_login
    @user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'adm@unb.br' LIMIT 1