SIGS/app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
SELECT  `periods`.* FROM `periods` ORDER BY `periods`.`id` ASC LIMIT 1 OFFSET 1
SELECT COUNT(*) AS count_all, `room_solicitations`.`solicitation_id` AS room_solicitations_solicitation_id, `room_solicitations`.`room_id` AS room_solicitations_room_id FROM `room_solicitations` WHERE `room_solicitations`.`department_id` = 2 AND `room_solicitations`.`status` = 0 GROUP BY `room_solicitations`.`solicitation_id`, `room_solicitations`.`room_id`
---
  def show
    @user = User.find(params[:id])
    @school_room_count = school_rooms_by_user.count
    @school_rooms_allocated_count = school_rooms_allocated_count
    @periods = Period.all
    department = current_user_department
    @solicitation_count = RoomSolicitation.where(department: department)
                                          .where(status: 0)
                                          .group(:solicitation_id, :room_id).size